package main

import (
	"fmt"
	"github.com/360EntSecGroup-Skylar/excelize"
	"strings"
)
func main() {
	f, err := excelize.OpenFile("17K-通用api内容输出分类-0730（已映射）.xlsx")
	if err != nil {
		fmt.Println(err)
		return
	}
	//newBookIdMap := make(map[string]interface{}, 0)
	// Get all the rows in the Sheet1.
	rows := f.GetRows("Sheet1")

	bookList := []string{
		"唯美纯爱_浪漫青春",
		"百合之恋_浪漫青春",
		"网配快穿_浪漫青春",
		"灵异悬疑_幻想言情",
		"玄幻仙侠_幻想言情",
		"异界魔法_幻想言情",
		"星际科幻_幻想言情",
		"末世危机_幻想言情",
		"异能空间_幻想言情",
		"西方奇幻_幻想言情",
		"家宅恩怨_古装言情",
		"宫廷贵族_古装言情",
		"穿越时空_古装言情",
		"快意江湖_古装言情",
		"架空历史_古装言情",
		"古代重生_古装言情",
		"前世今生_古装言情",
		"经商种田_古装言情",
		"职场丽人_都市言情",
		"青青校园_都市言情",
		"婚恋爱情_都市言情",
		"总裁豪门_都市言情",
		"游戏情缘_都市言情",
		"都市情缘_都市言情",
		"现代重生_都市言情",
		"娱乐明星_都市言情",
		"民国旧影_都市言情",
		"跨国情缘_都市言情",
		"虚拟网游_游戏竞技",
		"电子竞技_游戏竞技",
		"游戏生涯_游戏竞技",
		"篮球风云_游戏竞技",
		"天下足球_游戏竞技",
		"棋牌桌游_游戏竞技",
		"体育竞技_游戏竞技",
		"游戏异界_游戏竞技",
		"西方奇幻_玄幻奇幻",
		"东方玄幻_玄幻奇幻",
		"异界大陆_玄幻奇幻",
		"异术超能_玄幻奇幻",
		"异世争霸_玄幻奇幻",
		"魔法校园_玄幻奇幻",
		"领主贵族_玄幻奇幻",
		"传统武侠_仙侠武侠",
		"古典仙侠_仙侠武侠",
		"现代修真_仙侠武侠",
		"奇幻修真_仙侠武侠",
		"洪荒封神_仙侠武侠",
		"现代异侠_仙侠武侠",
		"历史武侠_仙侠武侠",
		"国术古武_仙侠武侠",
		"历史穿越_历史军事",
		"战争幻想_历史军事",
		"架空历史_历史军事",
		"军旅生涯_历史军事",
		"历史传奇_历史军事",
		"战史风云_历史军事",
		"谍战特工_历史军事",
		"未来幻想_科幻末世",
		"星际战争_科幻末世",
		"末世危机_科幻末世",
		"进化变异_科幻末世",
		"时空穿梭_科幻末世",
		"古武机甲_科幻末世",
		"都市生活_都市小说",
		"热血青春_都市小说",
		"都市异能_都市小说",
		"都市重生_都市小说",
		"职场励志_都市小说",
		"官场风云_都市小说",
		"都市激战_都市小说",
		"娱乐明星_都市小说",
		"商业大亨_都市小说",
		"校园风云_都市小说",
		"乡村乡土_都市小说",
		"臆想世界_自述小说",
		"现实经历_自述小说",
		"另类视角_自述小说",
		"灵异奇谈_悬疑小说",
		"恐怖悬疑_悬疑小说",
		"侦探推理_悬疑小说",
		"探险揭秘_悬疑小说",
		"婚恋情感_情感小说",
		"婆媳关系_情感小说",
		"家庭伦理_情感小说",
		"校园青春_青春小说",
		"纯爱青春_青春小说",
		"悲伤青春_青春小说",
		"幻想爆笑_爆笑小说",
		"现实爆笑_爆笑小说",
		"乡土文学_畅销经典",
		"人文史地_文化社科",
		"人物传记_文化社科",
		"修身养性_文化社科",
		"古代典籍_文化社科",
		"名家经典_畅销经典",
		"外国文学_畅销经典",
		"心理激励_经管励志",
		"新锐学术_文化社科",
		"最新畅销_畅销经典",
		"社会纪实_畅销经典",
		"经营管理_经管励志",
		"诗词散文_文化社科",
		"冷幽默_爆笑小说",
		"女生同人_二次元",
		"游戏同人_二次元",
		"动漫同人_二次元",
		"影视同人_二次元",
		"授权同人_二次元",
		"武侠同人_二次元",
		"宅系小说_二次元",
		"萌系小说_二次元",
		"灵魂转换_二次元",
	}

	for i, row := range rows {
		//按照格式输出
		if i > 1 {
			fmt.Printf("'%v_%v' => ['first_id' => %v, 'name' => '%v', 'third' => '%v'],\n",row[2],row[1],row[5],row[6],row[8])
			for i,book := range bookList{
				a := strings.Split(book,"_")
				//检测重复
				if a[0] == row[2] && a[1] == row[1]{
					//删除重复原有数据
					bookList = append(bookList[:i], bookList[i+1:]...)
				}
			}
		}

	}

	//输出原有数据未出现
	for _,book := range bookList {
		fmt.Println(book)
	}


}
